[
  {
    "id": "fandom_481138",
    "title": "Arc North",
    "description": "Oscar Christiansson (born June 1, 1997 (1997-06-01) [age 28]), better known online as Arc North is a Swedish YouTuber and music producer who uploads electronic dance music on his YouTube channel. Arc North launched his YouTube channel on March 28, 2015. He uploaded his first video, titled \"Arc North - Caravan\", on May 4, 2015. Note: The following dates are according to NoxInfluencer. Dates may vary by one or two days due to differences in time zones.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/2/20/Arc_North.jpg/revision/latest/scale-to-width-down/268?cb=20240517020356",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_376296",
    "title": "BBC",
    "description": "BBC, also known as the British Broadcasting Corporation, is the official YouTube channel that uploads news, films, animation, music, art, gaming and sports from the United Kingdom and British Crown Dependencies. The channel was created on November 11, 2005, and uploaded their very first video on January 19, 2007, which is Part 2 of Clive Myrie In Baghdad on BBC News, the video's now unlisted. On July 12, 2007, they made their first semi-viral video. They upload episodes of shows until they made their first viral video on September 30, 2007, titled Kitchen Gun—In stores now! 🔫😂 | The Peter Serafinowic Show—BBC, which is a clip from a show called The Peter Serafinowicz Show. The network has talked about YouTubers before. They did a piece on twomad when he would invade people's Zoom classes. When VTuber's became popular, they interviewed VShojo's only British members, Apricot the Lich and Veibae.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/e/e4/BBC.jpg/revision/latest/scale-to-width-down/268?cb=20211020214048",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_461893",
    "title": "Abeer Sinder - عبير سندر",
    "description": "Kali O'Neill, better known online as Abeer Sinder, is a Saudi Arabian YouTuber who uploads a wide variety of beauty videos. She is currently residing in Jeddah, Saudi Arabia. She has no upload schedule. Abeer Sinder launched her YouTube channel on October 10, 2015. She uploaded her first video, titled \"صح انها سودا بس حلوة -Lets talk\", on February 18, 2017. Note: The following dates are according to NoxInfluencer. Dates may vary by one or two days due to differences in time zones.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/9/96/Abeer_Sinder.jpg/revision/latest/scale-to-width-down/268?cb=20240509031336",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_516054",
    "title": "- Kataru -",
    "description": "- Kataru - (birthday: October 1), formerly Sword Gamer TV, is a Thai gaming YouTuber centered around Minecraft, while occasionally playing video games or making other videos. He is most famous for his most viewed video, \"「Challenge」ขุดเหมือง - SP - ผมกับพี่ทรู, พี่นุ้ยและ Pangboy\". He is also part of The Inventories. He posts primarily on Facebook and Twitter with occasional visits to other platforms. On his channel, he makes gaming-related videos, mainly on Minecraft. All of the videos are in Thai. He created his channel on August 28, 2012, and began uploading on February 24, 2014. On March 17, 2014, he made his first Minecraft-related video, playing Skyblock. On April 30, 2021, he appeared in the first video of The Inventories, which is a Minecraft skit.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/6/69/-_Kataru_-.jpg/revision/latest/scale-to-width-down/268?cb=20250502105726",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_244997",
    "title": "Asiamcgowan",
    "description": "Asia McGowan † (August 7, 1988 - April 10, 2009 [aged 20]), was an American YouTuber who uploaded vlogging videos on YouTube. Most of her videos were dance routines and comedy skits.[citation needed] McGowan was born in August 7, 1988 in the United States.[citation needed] She had a passion for dancing, and studied at the MacKenzie Fine Arts Center at Henry Ford College in Dearborn, Michigan. McGowan was also an aspiring actress, landing small roles in major films, such as Prayers For Bobby. She was also an outspoken advocate for women's rights, and an atheist. [citation needed] Tony48219 (Anthony Powell), a fellow student at Henry Ford College, took an interest in McGowan's YouTube channel and began leaving hateful comments on her YouTube videos, sometimes creating fake accounts to leave comments. Powell was known to be critical of Atheists and black women. McGowan released a YouTube video in response to the hateful comments she had been receiving.[citation needed] On April 10, 2009, Christian Plonka, a 12-year-old who attends a theater program in the building, said he heard “one gunshot (at the school), and I saw someone getting pulled back into the room they were in.”[citation needed] Christian and other students in the program ran into a parking lot at the adjacent University of Michigan-Dearborn campus, where they waited until police allowed them to leave.[citation needed] During the shooting, police ordered a school lockdown, during which they heard an additional gunshot. After entering the school, police found McGowan and Powell deceased, the latter from a self-inflicted gunshot wound.[citation needed] Shortly before the murder-suicide, Powell had released a video on his YouTube channel talking about his plan to take his own life. A viewer reported this video to the police, but was ignored.[citation needed] On September 29, 2021, the channel got hacked and was renamed to \"Ripple Ganz\". It's unknown how she got hacked as she was deceased, but on October 3, 2021, the channel got terminated. her channel was archived in the Wayback machine. Little to none of her videos are recovered.[citation needed] \"For all the ppl that felt like they wanted to constanty send me hatin messages this for u swettiessssss\" - description on her last video \"Asia's Youtube Haters\" \"Me actin stupid singing to sammie.... I like it.\"[citation needed]",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/d/da/Asiamcgowan.jpg/revision/latest/scale-to-width-down/268?cb=20201112164108",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_558041",
    "title": "Addy Gamer",
    "description": "Addy Gamer is a English YouTuber that has had the original TurboSquid Talking Tom model (CAT_CARTOON.zip) since 2006. He has found the 3D model on May 19, 2025 and shared the model on his discord server on May 26.[citation needed] Addy Gamer was an animation student in London that animated commercials for the British phone company Phonate Telecom (InTouch Communication Services Ltd) in 2007. He used several models for these commercials, including the original Talking Tom model (CAT_CARTOON.zip) from TurboSquid. He started to get attention and popularity in October 2024 when the YouTuber The 1st Gamer talked about him saying this was the first footage of Tom. Addy came across this video and he commented on the video. He then uploaded old and recovered animations such as non-commercial OnlyACall cat video and the Sylheti-language TeleBangladesh commercial video in the following days, including other ones with the Talking Tom model, like a Christmas and a new year special. He revived the search for the original Talking Tom model, that is in one of his 51 hard drives. He founds the model in his fifth and final searching session uploaded on May 19, 2025. Addy Gamer usually uploads and recovers his old commercials from, 2007, 2008, 2009, and 2010 and formerly finds the original Talking Tom model (CAT_CARTOON.zip).",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/4/49/Addy_Gamer.webp/revision/latest/scale-to-width-down/268?cb=20250605143427",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_133823",
    "title": "Ally Law",
    "description": "Alistair Sherringham Law (born: February 12, 1997 (1997-02-12) [age 28]), is an English YouTuber known for performing parkour stunts and doing free solo climbing on a range of buildings and structures. He also does overnight challenges where him and his friends sneak into buildings like water parks whilst avoiding police and security. He now uploads on his personal website. Ally Law was born in Southampton, England, United Kingdom. He attended the secondary school Oasis Academy Mayfield, leaving in 2013. Law notes that before starting parkour at the age of 16, he was \"extremely unhappy sat in [his] bedroom wasting away day after day, [he] had quit school and had no friends [and] had absolutely no idea what [he] wanted to do with [his] life.\" He had been addicted to a video game since the age of 13. Law continues to live in Southampton, and is a qualified carpenter. He often uploads the various stunts he performs to YouTube, and also occasionally does vlogs. This has got him in prison for a week for stealing a tea bag. He is a vegetarian and also doesn't drink alcohol. In December 2020, Ally released his first book called Living On The Edge. Ally also started a Twitch account and currently streams video games such as Call Of Duty. He often does extremely long streams lasting many hours to reach certain goals like reaching level 200 on COD Zombies for example. Law started his YouTube channel in December 2014. The video he uploaded was of him performing parkour on the top of buildings in Southampton city centre, filmed on a GoPro camera. Law started to receive local media attention in the Southern Daily Echo for his stunts in December 2015, after he scaled Dumbleton Towers in the Thornhill area of the city. He has climbed in many locations around the world, such as Melbourne, Dubai, Bangkok, and Barcelona. As a consequence of trespassing Thorpe Park to climb the Stealth roller coaster in July 2017, Law was globally banned from all Merlin Entertainment theme parks and amusements for life. In 2025, Law silently retired from uploading on his channels. The reason for his retirement is unknown, however it is likely that it was due to him becoming a father with a kid All of Law's videos were archived on the Wayback Archive. In May 2018, Ally worked with website development company Nullstack Limited to develop a subscription website service for his fans. The website allows Ally to share his YouTube forbidden content with his audience. The website has seen weekly uploads since May 2018 and looks to continue into the future while Ally has a restricted YouTube channel. Even with the website being active Ally has still seen growth on YouTube with the success of his second channel: Ally Laws Life.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/4/4f/Ally_Law.jpg/revision/latest/scale-to-width-down/268?cb=20180629214405",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_315210",
    "title": "7-Second Riddles",
    "description": "7-Second Riddles is a YouTube channel that focuses on riddles and brain teasers. It is maintained by TheSoul Publishing, the same company behind channels such as 5-Minute Crafts and BRIGHT SIDE. The channel is known for its controversial riddles that often involves dark themes and NSFW content. 7-Second Riddles, as the name implies, does videos pertaining to riddles which are statements, questions or phrases that have a double or veiled meaning. Viewers are asked to solve the riddle in a similar way they would a puzzle. They have 7 seconds to solve the riddle before the answers are revealed.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/d/d8/7-Second_Riddles.jpg/revision/latest/scale-to-width-down/268?cb=20231029002948",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_157760",
    "title": "ANDROMADA",
    "description": "Fabian, better known online as ANDROMADA (or simply Andro), is a YouTuber who lives with his partner, Chipflake (also known as Aaron) based in Düsseldorf, Germany and uploads videos and streams revolving around gaming, among other things. He has several different ongoing series, such as \"Try Me Bitch\", and \"Finding the Best Beer in the World\", as well as several series that have completed their runtimes, such as \"VidCon London 2019\" and \"7-Day Vegan Challenge\". Andro's character is a grim reaper-like character with dark grey horns, a patch of brown hair, a mask with completely white eyes, and no mouth or nose, as well as wearing a grim reaper style robe. Older designs of this character did not have horns, but instead wore a hoodie on his head, and you could see that he had more underneath the hoodie. This also has carried over to his newest design, where the hood has made a return, as well as the cuter design. Andro has gone through several different designs, including: Andro enjoys playing and streaming games. Some games that he likes and/or enjoyed are \"VVVVVV\", \"Minecraft\", \"Geoguessr\", \"The Uncertain: Last Quiet Day\", \"Pokémon: Gold\" and \"Cities: Skylines\". Andro enjoys PC Building, and can successfully build and upgrade a PC, as he showed on stream on August 13th 2020. Andro enjoys chiptune music, which he states when he played the game, \"VVVVVV\" on stream on February 5th 2021. This also carried over to his new channel soundtrack, which consists entirely of chiptune music. Andro also likes powermetal and death metal. This can be seen on Andro's old channel soundtrack, and the opening theme of a join channel between him and Chipflake, \"Cats of the Underworld\". Andro's old soundtrack was composed by Lovprod, and consisted of four songs: Andro's new soundtrack was composed by Tim De Jongh, and consists of three songs: Try Me Bitch is a series in which Andro tries out various foods (and drinks). The series currently has 10 episodes: Andro's Energy Drink Chronicles is a series in which Andro tries out various energy drinks. The series had 5 episodes: After Episode 5, the series was merged back into Try Me Bitch. German Culture is a series in which Andro details various things about German Culture. The series currently has 3 episodes: 7-Day Vegan Challenge was a series in which Andro took the challenge of going vegan for a full week. The series had 7 episodes: VidCon London 2019 was a series in which Andro (with Chipflake) travelled to London to attend VidCon. The series had 6 episodes: Finding the Best Beer in the World is a series in which Andro tries many varying beers in an attempt to find the best beer in the world. The series currently has 6 episodes. On top of videos, Andro also livestreams on YouTube every Monday, Wednesday and Friday.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/f/f8/Andro_PFP.png/revision/latest/scale-to-width-down/268?cb=20210218155035",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_521380",
    "title": "Ali Stroker",
    "description": "Alyson Mackenzie \"Ali\" Stroker (born: June 16, 1987 (1987-06-16) [age 38]), is an American actor, singer, and author. On her channel, she makes music videos, with the exception of Be More Heroic-What Can I do- Ali Stroker.m4v. When she was two years old, she and her brother, Jake, were in a car crash that left her paralyzed from the waist down, which made her use a wheelchair. She went to high school at Ridgewood High School, where she starred in school musicals and was senior class president. In 2015, she became the first actor in a wheelchair on Broadway. She won a Tony Award for the Best Supporting Actress In a Musical on c. June 10, 2019, making her the first actor in a wheelchair to win a Tony Award. Ali created her channel on January 12, 2010 and uploaded her first video on the same day, titled Ali Stroker- \"Here's Where I Stand\" CAP21 Senior Showcase. She uploaded her final video on May 23, 2012, titled Be More Heroic-What Can I do- Ali Stroker.m4v.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/0/0b/AliStroker.jpg/revision/latest/scale-to-width-down/268?cb=20231115134616",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_513661",
    "title": "Amazon Fresh",
    "description": "Amazon Fresh is an American subsidiary of the e-commerce company Amazon. Amazon Fresh is a grocery retailer with physical stores and delivery services. It was founded in 2007. It started in 2007 as an add-on grocery delivery service for Amazon Prime members. Amazon Fresh has rolled out its services gradually, targeting specific parts of various metropolitan areas and partnering with local speciality stores for delivery of local items. The Amazon Fresh website allows potential customers to check availability by postal code. In 2017, Amazon announced the beta launch, on March 29, 2017, of Amazon Fresh Pickup, a drive-in-type grocery store for Amazon Prime subscribers. It is a delivery service that lets users shop online, reserve times to pick up the groceries, and have them loaded into their cars at the store. In 2020, Amazon announced that they are using the name \"Amazon Fresh\" for their new chain of physical grocery stores in the Los Angeles and Chicago areas. The first Amazon Fresh grocery store opened to the public in September, in the Woodland Hills neighborhood of Los Angeles. In December, Amazon Fresh opened its fifth store and first location outside of California, in Naperville, Illinois. The channel was created on August 14, 2012, and the first video was uploaded on August 22, 2012. The channel uploads commercials and short cooking videos with groceries at Amazon Fresh stores.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/b/b7/Amazon_Fresh.jpeg/revision/latest/scale-to-width-down/268?cb=20230813165505",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_320912",
    "title": "Anko6",
    "description": "Antony Kos (born: May 27, 2000 (2000-05-27) [age 25]), better known online as Anko6 (formerly known as Anko6theAnimator), is a Canadian YouTuber, animator, and songwriter. He made Brawl of the Objects in 2013 and ended it in 2018. On May 17, 2020, he posted Twitter saying Brawl of The Objects Show is back. He posted a show for All for When show on May 26, 2016, and uploaded some songs on YouTube. As of June 2022, he is an animator at Elliott Animation Inc. for the Total Drama revival.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/4/4b/Anko6theAnimatorIcon.jpg/revision/latest/scale-to-width-down/268?cb=20210424114954",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_459437",
    "title": "Alfred Lewis III",
    "description": "Alfred Lewis III (born April 29, 2000 (2000-04-29) [age 25]) is an American YouTuber who makes beauty videos, mostly about wigs. Alfred is from Chicago, Illinois. He graduated in June 2018. Alfred started his online career making DIY videos for people to recreate, which turned into curly hair videos, and eventually became wig tutorials. In early 2019, Alfred rebranded from WTFALF, as it was \"just time\".",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/e/ed/AlfredLewisIII.jpg/revision/latest/scale-to-width-down/268?cb=20230308135840",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_228258",
    "title": "Adrian Gee",
    "description": "Adrian Gruszka (born: August 3, 1993 (1993-08-03) [age 32]), better known online as Adrian Gee, is an Australian-American YouTuber known for his investment programs mentioned in the videos along with videos on talking to young females about topics such as relationship. The interview videos usually involve Adrian asking people to do a task or to answer a question, and there is usually a spin on the topic was are supposed to create a response. Most of the videos are 5-15 minutes long. Many of the videos take place in different countries which is usually indicated by the title in the video, and the thumbnails are custom with a picture of a female person with text similar to the title of the video. There are also older videos which do not have custom thumbnails, and these videos are usually comment trolling question. The comment trolling videos involve a compilation of copying statements or questions from the comments section which are awkward and mentioning other people, and the reaction of the listener can vary. There are social experiment videos which had a video of leaving money in an ATM or dropping a card on the ground. He is verified, and there is another vlog channel called AdrianVlogs.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/0/03/AdrianGee.jpg/revision/latest/scale-to-width-down/268?cb=20240510182615",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_412211",
    "title": "BartekGM",
    "description": "Bartłomiej Pokorski (born: May 1, 1996 (1996-05-01) [age 29]), known online as BartekGM, is a Polish YouTuber from Warsaw. He's commonly known for creating the video game review series Najgorsze Gry Wszechczasów (ENG: Worst Games of All Time) in which he uses the text-to-speech software IVONA. His first online activity was allegedly under the nickname Kaszankonator, and later on, Karmelowa Bułka. During the 2000s, Bartek used to be a member of the disbanded \"Ciapskład\" website which created parodies and YTPs. He uploaded some of his videos on the BudowaStudios channel. Bartek created his first Najgorsze Gry Wszechczasów episode on the 22th of January in 2009, where he reviewed the game Ardennes Offensive. As time went on, Najgorsze Gry Wszechczasów became one of Poland's two most popular bad video game reviews, next to NRGeek's Zagrajmy w Crapa.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/a/a9/BartekGM.jpg/revision/latest/scale-to-width-down/268?cb=20210814224347",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_452461",
    "title": "Ariel Coviello",
    "description": "Ariel Coviello (birthday: October 25) is a Canadian YouTuber who is originally known for filming scary horror skits with his friends. He created his channel on July 14, 2020, and uploaded his first video on October 21, 2020, showing his roommate denting his car door. He currently resides in Toronto, Canada.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/1/14/B22I6939YT.jpg/revision/latest/scale-to-width-down/268?cb=20220314021441",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_270349",
    "title": "Alienware",
    "description": "Alienware is a computer hardware manufacturer headquartered at The Hammocks, in Miami, Florida. Established in 1996 as Saikai of Miami, Inc. by Nelson Gonzalez and Alex Aguila, Alienware has assembled desktops, notebooks, workstations, and PC gaming consoles. According to the employees, the name \"Alienware\" was chosen because of the founders' fondness for the hit television series The X-Files, which also inspired the science-fiction themed names of product lines such as Area-51, Hangar 18, and Aurora. In 1997, the company changed its name from Saikai of Miami to Alienware. Dell, another computer brand company, had considered purchasing Alienware since 2002, but did not agree to purchase the company until four years later. As a subsidiary, Dell retains control of its design and marketing while benefiting from Dell's purchasing power, economies of scale, and supply chain, which lowered its operating costs. Initially, Dell maintained its competing XPS line of gaming PCs, often selling computers with similar specifications, which may have affected Alienware's market share within its market segment. Due to corporate restructuring in the spring of 2008, the XPS brand was scaled down, and the Desktop line was eliminated, leaving only the XPS Notebooks. Product development of gaming PCs was consolidated with Dell's gaming division, with Alienware becoming Dell's premier gaming brand. On June 2, 2009, The M17x was introduced as the first Alienware/Dell branded system. This launch also expanded Alienware's global reach from 6 to 35 countries while supporting 17 different languages. Alienware, as of today, produces desktops and laptops with processors provided by Intel and AMD. Also, dedicated graphics cards are included in every Alienware computer provided by NVIDIA and AMD. In 2014, Alienware released a graphics amplifier, which can host a desktop-class GPU and connect to an Alienware laptop released by 2014 or later.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/8/88/Alienware.jpg/revision/latest/scale-to-width-down/268?cb=20241221124930",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_57826",
    "title": "Appoes",
    "description": "Justin (born: May 7, 1987 (1987-05-07) [age 38]), better known online as Appoes, is a Canadian gaming and comedy YouTuber. He uploaded his first video, 'Some minecraft pvp fun', on November 10, 2013, and has been uploading content ever since. His channel is orientated around comedy-gaming, and he is skilled at PvP (player versus player) in particular. He is also the founder of a YouTuber collaboration, Team Kill Steal (TKS). He use to be staff on a Minecraft server 'Omega Realm', however he later retired and became a YouTuber instead. Along with that, he has the same rank on The Grid. He also use to have a YouTuber rank on another server, MC-SG, although it was taken away from him for unknown reasons. In this series, Appoes hops onto an alternative Minecraft account, and starts PvPing on Omega Realm's 'KitPvP' game mode. Although, in special episodes, he would troll on other servers as well. He would go on massive kill streaks. The aim would be to get hackusated (accused of hacks), by someone by the end of a video. For the first few videos of this series, Appoes would use his private alternate account, 'seoppA' (Appoes backwards), and censor chat so that the viewers would remain unaware of the account name. However, Appoes started using public alts and borrowing friends' accounts, so that he could uncensor chat and the video would be more enjoyable. Even though this series is generally a solo series, some collaborations with other TKS members were made. This series is where all special videos and update videos are made. It can be everything from a message to his subscribers to a new series announcement. In this series, collaborations with TKS are made. They would hop onto different Minecraft servers and play mini-games or adventure maps. Appoes' Minis are short, funny skits. In this solo-series, Appoes picks challenges from the comments and puts them into a hat. At the start of the video, Appoes picks a challenge and plays Survival Games on the server 'Mineplex' while doing that challenge.For example, his first challenge was to play while twerking. This is the only series where Appoes uses a facecam, reason being so that the viewers could see his reactions. This doesn't really count as a series. It is the category where all random videos go into. This was a series on Omega Realm's 'Factions' game mode. The Faction includes TKS members as well as fans. His very first recruits were players named Coolhlh and Gluggernot. At first, Appoes would invite random people to the faction, however after a few episodes, the faction become the most powerful one on the server, and inviting random people was too risky as it would get raided or griefed, so an application process on Omega Realm's forums was made. The reason it is called 'Murica' is because the faction 'gives freedom to their members and steals freedom from other factions'. 'Freedom' is the most over-powered kit in the game, and Murica has gained loads of it from raids. However, Appoes one day stated",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/6/62/Appoes.png/revision/latest/scale-to-width-down/268?cb=20180722040106",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_561674",
    "title": "Baka Oppai",
    "description": "Baka Oppai (born October 9, 1993 (1993-10-09) [age 32]) is an American YouTuber who makes AMVs as well as comedic anime parody videos, such as the extremely popular Anime 404. He created his channel on December 23, 2012, and began uploading on December 30, 2012, about a week after creating the channel. His parodies are commonly reacted to by other YouTubers, such as the popular YouTuber Chibi Reviews, among others. His channel remains inactive nowadays, as he hasn't uploaded a video since January 16, 2016; that video was One Punch Manstep. He only uploaded 27 videos during his few years as a Content Creator, but during that time, he amassed almost a million total video views.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/e/e6/Baka_Oppai1.jpg/revision/latest/scale-to-width-down/268?cb=20210220203030",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_483469",
    "title": "Awkward Anthems",
    "description": "Awkward Anthems is an American commentary YouTuber. She is a former editor of LegalEagle. She created her channel on March 20, 2013, and upload her first video on April 2, 2022, titled \"Dancing in Fire, Like No One's Watching!\" She started getting more popular after she uploaded a video titled \"LegalEagle's Former Editor Speaks Out,\" which gained over 1 million views.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/5/50/Awkward_Anthems.jpg/revision/latest/scale-to-width-down/268?cb=20221021111417",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_371547",
    "title": "AkuroPlays",
    "description": "Jonathan Smith (born: November 1, 2003 (2003-11-01) [age 22]), better known online as AkuroPlays, is an Australian informational & experimental Minecraft YouTuber. Jonathan grew up in Adelaide, South Australia. He started his channel in 2015 but only in the last 12 months he has started to grow. He is passionate about making Minecraft Servers, and was an old developer of two Minecraft servers called PikaNetwork and JartexNetwork. According to his old viewers, he has released many other servers which were well-known in the Minecraft Community, all being either Prisons or Skyblock. Note: The following dates are according to Social Blade. Dates may vary by one or two days due to differences in time zones.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/d/db/AkuroPlays.png/revision/latest/scale-to-width-down/268?cb=20210130115524",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_372793",
    "title": "A+Start",
    "description": "Andy Collins, better known online as A+Start, is a gaming YouTuber known mostly for his Son of a Glitch series, in which he covers one video game (usually published by Nintendo or Sega) and covers the majority of the glitches that can be found in said game, usually explaining how to perform them and why they occur. More recently, he has also become notable for his Glitch Shorts videos, in which he explains a single glitch from a game, as well as his Low Poly series, where he looks at how character models have evolved over the course of a video game series' duration. Prior to his current content, he was a let's player. He has previously created videos under the series Son of a Glitch Speedruns, in which he speedruns a game whilst commentating over the footage, explaining how the speedrun works and what he is doing. Other video series he has produced include Egg Bombs, where he looks at Easter Eggs (secrets) hidden inside popular video games, and 10 Things About, a factoid video series similar to DidYouKnowGaming?. He owns a secondary channel titled A Start Arcade, where he posts livestream archives. On January 7, 2021, he setup a channel called Glitch Shorts for the series, due to the fact that he was losing subscribers who were not interested in these videos. He is also a co-host of Game Club Podcast, which is hosted along with Beta64 and Shesez. Outside of his YouTube career, he is a director on the video game Sonic Chaos - a fan game and modern reimagining of the 1993 game of the same name. He has three Patreon tiers: $1, $2 and $10, which are paid monthly. The $10 tier rewards patrons by displaying their name at the end of Son of a Glitch videos.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/5/5a/A%2BStart.jpg/revision/latest/scale-to-width-down/268?cb=20210103141625",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_463506",
    "title": "AltWorldly",
    "description": "Jake Vaughn, better known online as AltWorldly, is an American YouTuber who makes videos critical of Jehovah's Witnesses.[citation needed] Jake is married. He has a cat. He works in a hospital. In April 2021, Jake was hospitalised for severe bleeding due to Crohn's disease. His life was saved to a transfusion. At the end of 2021, he had surgery as the illness became worse. Jehovah's Witnesses' stance against higher education prevented Jake from attending art school. Jake left Jehovah's Witnesses in his thirties, and made his early videos whilst hiding his apostasy. He began to question his beliefs after seeing a video of one of the governing body members. For some time, Jake had also had issues with homophobic teachings. He later learned about groups with extreme and fundamentalist views from Hbomberguy, and gender and sexuality from ContraPoints. This led him to a breakdown. After reading about disfellowshipping, he conducted research using NPR, watched atheist YouTubers, and read Crisis of Conscience.[citation needed] When Jake stopped attending online religious meetings, it took some time for elders to notice, as he and his wife did not normally have their Zoom camera on. Jake was formally disfellowshipped on April 20, 2021. Elders monitored his YouTube channel. Jake established the website JW FAQ, to rebut the articles found on the Frequently Asked Questions section of the Jehovah’s Witness’ official website, described as \"regrettably full of misinformation and deception.\" In 2022, Jake was critical of fellow ex Jehovah's Witness Lloyd Evans, due to controversies surrounding his personal life, activism work, and legal threats against other activists. He discussed various incidents and allegations against Lloyd. In March 2022, Jake received a letter from Lloyd's legal representatives, alleging that Jake made false, insulting, and defamatory and fabricated allegations. After receiving the letter, Jake offered to take down the offending video, on the condition that Lloyd donate the revenue from his next video to a charity working in Ukraine.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/f/fd/AltWorldly1.jpg/revision/latest/scale-to-width-down/268?cb=20220609171349",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_349805",
    "title": "Alex Hefner",
    "description": "Alex Hefner (born January 11, 1994 (1994-01-11) [age 31]) is an American YouTuber originally known for his series \"Hip Hop Head Reacts to Metal,\" where he reacts to hard rock and heavy metal music as a self-described \"hip-hop head\". He moved to Hawaii in 2023. Alex Henfer has four other channels. They are:",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/b/bf/AlexHefner.jpg/revision/latest/scale-to-width-down/268?cb=20201110033200",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_391000",
    "title": "Ashswag",
    "description": "Ash (born: January 16, 2004 (2004-01-16) [age 21]), better known online as ashswag, is an Indian-American YouTuber known for his Minecraft videos and YouTube Shorts. He joined YouTube on September 9, 2017, and uploaded his first video between 2017 and 2021. He started to gain subscribers and views in November 2020, most likely his videos.[citation needed] He uploaded his first YouTube Short on January 12, 2021, which is him explaining the Dream SMP in one minute. Then, he uploaded his first non-YouTube Short video on March 18, 2021, which is him trying to see how big the Dream SMP was.[citation needed] His channel gained traction in February 2021, and made a video about raiding a viewer's SMP. As of September 10-11, 2022, his main channel has become one of many channels hacked by Ripple to stream a lawsuit. His channel returned to normal the same day.[citation needed] On November 18, 2021, he made his first video of the Lifesteal SMP, a server where you lose permanent hearts via death and gain hearts by murder or simply crafting them yourself. After sleeping through most major events in Season 2, he joined Season 3. During Season 3, he willingly committed suicide on the server after establishing communism and becoming the most powerful player. [citation needed] During July 2022, he uploaded his first Earthbound SMP video. The Earthbound SMP is an SMP built on a Minecraft replica of Earth, like the similar Earth SMP. He also supports LGBTQ+, but this has not been confirmed yet as he used to have a rainbow flag on his shoulder in his skin.[citation needed] Ash is currently dating Minecraft Youtuber Squiddo. MC Championship is a Minecraft Tournament for YouTubers and streamers run by the Noxcrew, in which 10 teams of four compete in a series of 8 minigames decided by the participants. A point multiplier makes each game worth more as each round passes, incentivizing teams to vote for games they might be bad at early on in the event. In the end, the two teams with the most points face off in a round of ‘Dodgebolt’ to decide the winner of the tournament. This makes it possible for a team to win despite potentially having fewer points than the runner-up. MCC Rising was an event organized by the Noxcrew that took place on October 2, 2021, in order to give smaller \"rising\" streamers a chance to play. Creators of all sizes were invited to apply for the event, the only requirements being that they didn't already play in the main event and that they were able to stream it. Note: The following dates are according to Social Blade. Dates may vary by one or two days due to differences in time zones.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/6/6c/Ashswagappearance.jpg/revision/latest/scale-to-width-down/268?cb=20250802035038",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_538236",
    "title": "Asht0n Vibez",
    "description": "BL00DYcAsh (formely known as Asht0n Vibez) (born: 2003 [age 22])[citation needed] is an American[citation needed] Gaming YouTuber known for making ROBLOX short videos. His avatar is based off a ROBLOX style called \"Slenders\".[citation needed] Asht0n Vibez originally started on TikTok in 2022 by making satirical \"catboy slender\" videos, which eventually got him on Koofy's \"Roasting Cringy Roblox TikToks...\" video. He later created his channel on Mar 26, 2023 and uploaded his first short video \"new slender youtuber :)\" on the same day. His first full length video was posted on Dec 31, 2023. Most of his real-life identities are unknown. However he has revealed that he is Ojibwe, a native American.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/8/8c/Asht0n_Vibez.jpeg/revision/latest/scale-to-width-down/268?cb=20240629053531",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_500607",
    "title": "AnimeLoverAly",
    "description": "Alyssa (born: October 6, 1997 (1997-10-06) [age 28]), better known online as AnimeLoverAly, is a Canadian YouTuber. She uploads gaming videos and livestreams. Her earliest videos were The Sims 4 Legacy gameplay, though she has also uploaded videos of herself playing Terraria, Phasmophobia, Atomic Heart, The Legend of Zelda: Tears of the Kingdom, Among Us, Stardew Valley, Genshin Impact, Project Playtime, Sons of the Forest and Devour amongst other games. She also has videos dedicated to speedpaints, cooking and vlogs.[citation needed] Her most viewed gaming videos are of her playing Persona 4 Golden. In 2022, she debuted as a VTuber. As stated in her Twitter bio, she illustrated and rigged her own VTuber model. She has two cats, Hina and Bandit. Hina is named after Hinata Hyuuga from the Naruto series.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/c/c6/AnimeLoverAly.jpg/revision/latest/scale-to-width-down/268?cb=20230401171328",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_383622",
    "title": "Arcade Craniacs",
    "description": "Edward Centeno (born: January 27, 1992 (1992-01-27) [age 33]), better known online as Arcade Craniacs, is an American YouTuber known for his \"3 AM\" videos that feature ironic and satirical comedy. In January 2017, Centeno was beaten in the face by a stranger with a metal baton, which later required surgery. This incident left Centeno depressed, not feeling motivated to do anything. Centeno organized a GoFundMe fundraiser to pay for his injuries. He managed to raise a large amount of money due to his GoFundMe being promoted by The Berrics, a large Los Angeles Skate Park and collective. Afterwards, he fell down a rabbit hole of YouTube videos about arcade games and claw machines. He noticed that the people making the videos were catering to a PG-13 audience, which gave him the idea to start his own arcade channel, though catering more towards adults instead. Centeno and his former girlfriend Nikki started the channel Arcade Craniacs, which quickly gained traction due to how different their channel was compared to others. \"It was a simple title, no one had really done it yet. Since the arcade community is quite small, we quickly began to stick out as different by catering our video toward adults who enjoyed claw machine and arcade videos.\" One day in July 2020, there were rumors on Twitter about Chuck. E. Cheese going bankrupt because of the Coronavirus pandemic. Centeno has always been a huge fan of Chuck. E. Cheese. So much so that his family nicknamed him “Chucky”. Centeno mentioned the rumors to Nikki, who then both filmed a few videos about Chuck E. Cheese that were uploaded on Nikki's personal channel. They noticed a huge spike in views on her channel, which then made them decide to make a Chuck E. Cheese video for the Arcade Craniacs channel, and as it turned out that video started the transition to their current content. The Coronavirus pandemic greatly affected the channel's views, as Centeno and his girlfriend could not travel to carnivals as they were closed. Therefore could no longer make the content they promised their viewers. The Arcade Craniacs channel then transitioned to the infamous \"3 AM\" videos that had been prevalent on YouTube since 2017, though to differentiate themselves like they did with the original arcade videos, they made their new content cater towards adults once again. Their videos feature heavily ironic and satirical comedy to keep the older audiences entertained, which has proven successful as the channel has gone viral through their \"out of context\" clips. Edward's first videos were about how to win carnival and arcade games, and recording himself trying them out and how to win them. A lot of them were centered around Disneyland games. Majority of his content was about him and Nikki trying out various arcade machines all over the country, but it wasn't until July 18, 2020, where he uploaded his first 3 AM video, something that would overtake everything else on his channel. Though it was about Chuck E Cheese, he ha",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/e/ed/Aracdecraniacs.jpg/revision/latest/scale-to-width-down/268?cb=20210324170049",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_534843",
    "title": "Adhemz",
    "description": "Adhemz is a New Zealand[citation needed] YouTuber who is known for his reaction and review videos. Adhemz would create his channel on February 28, 2012, and wouldn't upload his first video until June 18, 2017. He would often post videos about tutorials and vlogs. Between November 2022 and the full year of 2023, Adhemz would see huge growth in his channel, with it gaining about 7.42 million subscribers. Note: The following dates are according to Social Blade. Dates may vary by one or two days due to differences in time zones.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/3/34/AdhemzPFP.jpg/revision/latest/scale-to-width-down/268?cb=20240505073436",
    "subscribers": "N/A"
  },
  {
    "id": "fandom_552865",
    "title": "Al1",
    "description": "Al1 (birthday: August 20) is a Canadian YouTuber who is known for his Modded videos on the sandbox game Minecraft. He is a member of the Goofy Gang alongside CheapPickle, tinymacdude, Creebus, estabr0k, and Wallibear. Al1 also posts videos on the FPS game Valorant on his second channel. He originally posted about a variety of shooters, including Fortnite and CoD: Warzone before switching to wholly Valorant content on that channel. Al1 posts gaming videos on the game Minecraft, usually modded to serve as a theme. His videos usually showcase various Mods of the game, whether it be horror mods, randomizers, or simple \"fun\" playthroughs of the modded game, such as Hide-and-Seek. However, he also uploads videos on the FPS shooter game Valorant. He originally started his YouTube career doing Valorant content before switching his main focus to Minecraft videos. He also occasionally posted videos on the battle-royale game Call of Duty: Warzone. Al1 started his YouTube career by making the Ali1 channel on August 24, 2012. Then he would start his YouTube career by posting long form videos on the game Valorant. His first video was posted on April 29, 2021. However he would also start posting Shorts, albeit later on in his career, on the battle royale game Call of Duty: Warzone. His first YouTube Short was posted on November 24, 2022. Al1 then started a second channel with the same name, Al1 on February 28, 2024. This second channel would serve as his Minecraft channel where he would post Minecraft videos and Shorts. His first Minecraft Short was posted on July 5, 2024 and his first Minecraft long form video was posted on August 18, 2024. Eventually, throughout 2024, the Minecraft channel would then become Al1's main channel, and his Valorant channel would be his secondary.",
    "thumbnail": "https://static.wikia.nocookie.net/youtube/images/a/a6/Al1.jpg/revision/latest/scale-to-width-down/268?cb=20250517132801",
    "subscribers": "N/A"
  }
]