[
    {
        "id": "fandom_163603",
        "title": "Gamer Chad",
        "description": "Chad Alan, (born: August 18, 1984 (1984-08-18) [age 41]) better known online as Gamer Chad, is an American Roblox YouTuber famously known for his Roblox gameplays and roleplays, and Minecraft minigames, and silly and spontaneous personality. Many of Chad’s videos also feature his friends like DOLLASTIC PLAYS!, RadioJH Games, and MicroGuardian. In addition to Chad’s roleplays and gameplays, Chad also had a series called Famous Babies, where he roleplays as a baby with his friends. He also has a vlog channel, where he unboxes dolls, toys, shows his cats or Disney related content. From 2013-2016, he was a popular Minecraft creator, posting mainly Minecraft Murder, Bridges Friday and Pixel Painters, along with a Survival Adventure with Audrey, Lastic and SallyGreenGamer. In 2016, he discovered Roblox and began to journey by playing a plethora of games. He was one of the biggest Roblox YouTubers from 2016-2018, often gaining millions of views, alongside with friends. He and Audrey even made it into Roblox Rewind 2017: The Oof of 2017. He has created many iconic characters in his channel, such as Enderwoman, Baby Alan and Bimbolicia. In 2019, he launched an animated series of his Baby Alan roleplay, with a full productive team of voice cast and animators. He also launched five animated shorts parodying Roblox games like Natural Disaster Survival, Flee the Facility and Jailbreak. In recent years, Chad has been more casual, uploading less, and of more calm content. He mainly plays RoPets and Brookhaven, but he isn't afraid of caving into new games. He also started to play a lot with his old friend CookieSwirlC, along with Ryan and Lastic He is part of the collaborative gaming group The Taco Crew consisting of him, Audrey, Lastic and Ryan. They usually play Roblox or Minecraft. They were one of the most popular gaming groups from 2017-2018. Their favourite games are Flee the Facility, Murder Mystery, and Bloxburg, as they have released several videos on those games and always have a blast playing them. The Taco Crew Mansion was a series created by Chad in summer 2018 in Roblox's Welcome to Bloxburg based around a giant mansion as the crew's home. They have had several adventures going camping, goofing around or going on road trips. They ended the series in winter 2018 due to creative burnout, but it has been one of the most popular series they have all done. Ironically, Lastic has never made a video in the mansion (she did participate in the first episode and the 4th of July special though). After teasing it in the Mansion series, they started a Minecraft let's play for 1.13. This is inspired by the an earlier survival series by the crew, excluding Ryan and including SallyGreenGamer. They build several houses and structures, with the main focus being interacting with the new mobs and mechanics. This series ended around the same time as the Mansion series. This was the first and only time the crew ever fully met up in person. They attended Vidcon and met several fans and events, while also going to Disneyland to celebrate Lastic's 30th birthday. While they haven't collaborated as a group since around 2019 due to creative differences, they have confirmed that they still are friends and remain on good terms. Note: The following dates are according to NoxInfluencer. Dates may vary by one or two days due to differences in time zones.",
        "thumbnail": "https://static.wikia.nocookie.net/youtube/images/4/4e/GamerChad.jpg/revision/latest/scale-to-width-down/268?cb=20221229084723",
        "subscribers": "N/A",
        "url": "https://youtube.fandom.com/wiki/Gamer_Chad"
    },
    {
        "id": "fandom_286626",
        "title": "Channel Mat",
        "description": "Matan Steinhart, better known online as Channel Mat, is an Israeli YouTuber who has started over 2 years ago and currently has over 1.4k subscribers. His first video was called \"blanket house!!!\", which currently has over 700 views and 100 likes. After that Channel Mat had a hard time finding success, and after 2 years with only 180 subscribers, on August 26, 2019, he posted a video titled: \"This video needs to get 1000 views\" and then his channel skyrocketed getting 10s of subscribers a day. The video of 1000 views has currently today over 1.5k views and 97 likes. 3.5 months later, on December 14, 2019, Channel Mat hit his big goal of 1000 subscribers. A few weeks later YouTube sent him a special \"Play Button\" for hitting 1000 subscribers, and many fellow YouTubers like \"Shrinky6\" (which no longer creates content), \"Ago 45\", \"beentheredonethat\" sent Channel Mat some more custom play buttons. Noam Steinhart, Ariel Steinhart,and Naf Steinhart are part of the so called \"Mat- Team\" and they help with filming the videos. Noam Steinhart- called \"editor noam\", has been in many different videos, and except for Matan, he is one of the big roles in \"Channel Mat\" being in many videos like: \"rules of survival\", \"trick shots\", \"epic battle\" and many more. And also winning the first battle! 'Naf Steinhart- more known as \"manager naf\" has been a big part of many videos like: \"Coronavirus video\", \"Dude perfect parody\" and many more. He is also Matan Steinhart''s cousin. Steinhart lives in Beit Shemesh, Israel and has 4 brothers. He is 17 years old. Some of his popular videos posted are:",
        "thumbnail": "https://static.wikia.nocookie.net/youtube/images/3/3d/ChannelMatIcon.jpg/revision/latest/scale-to-width-down/268?cb=20200526113104",
        "subscribers": "N/A",
        "url": "https://youtube.fandom.com/wiki/Channel_Mat"
    },
    {
        "id": "fandom_545501",
        "title": "Supersnailboy",
        "description": "supersnailboy (born: November 25, 2008 (2008-11-25) [age 17]) is a British-Polish YouTuber. He is well known for his Lego building skills, and building as well as crashing realistic model planes built out of Lego. He is known to have started the \"Lego Aviation\" trend on YouTube. One of his series, where he recreates real life aviation incidents and accidents using Lego planes, has become extremely popular and many other YouTubers have made similar content. The account was created by his parents on 10/09/2006. The first video on the channel was created by a family member on 16/08/2008, 3 months before he was born on 25th November of the same year. He gained the account when he was 7 and only started uploading in 2019. The first video he uploaded on 25/04/2019, which was a Minecraft video about starter houses. then in May he uploaded his first Lego related video and his first crash video along with his first Lego stop motion. On 21st June, he made his first Lego plane crash video called Lego Plane Crash 1 using a 60104 set he got for Christmas and then made a 10 episode trilogy along with a Minecraft plane crash video. Suddenly, he disappeared with no exact explanation at 1500 subscribers in 2022. In April of 2023, a huge idea, a huge plan, a huge motivation. After 10 months he came back, sticking to Lego Aviation, making this video. He chose to stick with high quality editing and a fast paced content style. He later made a sequel to the video on 6th May, 2023 titled HUGE Lego Plane CRASHES and on 29th May, 2023 he made a another video in which he crashes his Lego planes at the beach and the thumbnail of the video became his profile picture. Then in another video where he crashes his planes into his pool. In August 2023, he went on vacation to Poland to crash his modified 3181. In July 2023, Supsnail started filming his first recreation video starting with Air Florida flight 90 and JAL123. In September he finished making his recreation video by making the Los Rodeos, Tenerife airport disaster. He then uploaded the recreation video on 04/09/2023, it went viral, becoming his 3rd most popular video as of now. On 30th Sept, 2023, he put 24 hours of editing and 10 days of filming into Lego Plane CRASHES IN FIRE. he than bought the 60367 set and started filming the 2nd recreation video using suggestions from fans. He finishes the video in November and created his own discord server. In December Supsnail made “Lego Plane Crashes in snow” and reached 50,000 subscribers before filming the trailer for the 3rd recreation. He also made a crash rating video where he rates Lego Plane Crashes made by his fans. On 18th February, 2024, SupSnail uploads his 3rd recreation video involving 3 crashes, 2 Emergency landings and the Überlingen Mid-Air collision. On 15th March, 2024, SupSnail reaches the insane goal of 100,000 subscribers. He uploaded a temporary video asking for his fans to ask questions about him. Shortly after he uploaded his Flight to 100K subscribers video, in which he explains his background, channel history, answers QNA’s, makes his own airline with the flight to 100K livery, and did a sneaky face reveal at the very end of the video. SupSnail later made a 2nd fan made crashes video and uploaded it on 13th April, 2024, making it his longest video at 41:51. On 11th May, 2024, SupSnail uploads 10 Piece VS 10,000 Piece Lego Plane Crash going viral, marking a new era of the channel. He than uploaded his 3rd fan made crashes video and some clip compilations. On 13th July, 2024, SupSnail uploads the trailer for season 2 of the recreation trilogy, having a sneak peek of his Emergency landing video (S2E1) and Mid-Air Collisions video (S2E2). A week later he uploaded his emergency landings video where he accurately recreates 5 Emergancy landings, later uploading a behind the scenes where he shows the terminal and creation of the aircraft in the video. On 8th September, 2024, he uploads 10 Piece VS 10,000 Piece Lego Plane Crash IN POOL becoming his most successful video gaining 1 million views in less than a week. The video is currently sitting at over 7 million views and almost instantly helped him to climb up to 200k subscribers. In October of 2024, SupSnail uploads a tutorial of his 3, 747 nose designs, 2 of which in the pool video and the other in the up coming Mid-Air Collisions video. 15th December, SupSnail uploads the highly anticipated Mid-Air Collisions featuring the 4 recreations in the video, each getting more deadly as the video progresses showcasing each highly realistic plane. In January 2025, SupSnail uploads the behind the scenes video of the Mid-Air Collisions video showcasing how each plane and background set was made, also showcasing the IL-76 made and given by BrickMasterPoland for the Charkhi Dadri Mid-Air Collision. Not much later, SupSnail uploads the highly anticipated 4th fan made crashes video including realistic and silly crashes made by his fans! On 8th February, 2025, SupSnail uploads the highly teased Dangerous Ways to Destroy a Lego Plane in which he destroys planes in dangerous ways, featuring a cliff drop and even explosives, destroying each plane including an accurate A380. On March 5th, 2025, SupSnail uploads a 3 plane tutorial video, showing how to make his 737, and the 757, and 787, shown in Dangerous Ways to Destroy a Lego plane.",
        "thumbnail": "https://static.wikia.nocookie.net/youtube/images/b/b1/Supsnail.jpg/revision/latest/scale-to-width-down/268?cb=20241026224646",
        "subscribers": "N/A",
        "url": "https://youtube.fandom.com/wiki/Supersnailboy"
    }
]